In [180]:
import numpy as np
import pandas as pd
import statistics as st
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

### An Institution wishes to find out their student’s ability in mathematics, reading and writing skills. The Institution wants to do an exploratory study to check the following information.

In [181]:
data=pd.read_csv('StudentsPerformance.csv')
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [183]:
data['avg score']=(data['math score']+data['reading score']+data['writing score'])/3
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg score
0,female,group C,some high school,free/reduced,none,0,17,10,9.000000
1,female,group B,high school,free/reduced,none,8,24,23,18.333333
2,female,group B,some high school,free/reduced,none,18,32,28,26.000000
3,female,group B,some college,standard,none,11,38,32,27.000000
4,female,group C,some college,free/reduced,none,22,39,33,31.333333

In [184]:
data.describe()

        math score  reading score  writing score    avg score
count  1000.000000    1000.000000    1000.000000  1000.000000
mean     66.001000      69.195000      68.119000    67.771667
std      15.569567      14.706436      15.226381    14.409003
min       0.000000      17.000000      10.000000     9.000000
25%      57.000000      59.000000      58.000000    58.333333
50%      66.000000      70.000000      69.000000    68.666667
75%      77.000000      79.250000      79.000000    77.750000
max     100.000000     100.000000     100.000000   100.000000

### 1. Find out how many males and females participated in the test.

In [185]:
data.gender.value_counts()

female    518
male      482
Name: gender, dtype: int64

### 2. What do you think about the students' parental level of education

In [186]:
data['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [189]:
data1=data.groupby(['parental level of education'])[['math score','reading score','writing score','avg score']].mean()
data1

,math score,reading score,writing score,avg score
parental level of education,,,,
associate's degree,67.977477,71.018018,70.031532,69.675676
bachelor's degree,69.288136,73.000000,73.381356,71.889831
high school,61.821429,64.602041,62.403061,62.942177
master's degree,70.254237,75.949153,75.677966,73.960452
some college,67.128319,69.566372,69.035398,68.576696
some high school,63.134078,66.759777,64.888268,64.927374

#### Most student's parents have some college or associate's degree or high school as level of education
#### Students whose parents have master's degree have high average marks
#### Students whose parents have high school qualification shows less average marks

### 3. Who scores the most on average for math, reading and writing based on
#### ● Gender
#### ● Test preparation course

### Based on Gender

In [190]:
data1=data.groupby(['gender'])[['math score','reading score','writing score','avg score']].mean()
data1

        math score  reading score  writing score  avg score
gender
female   63.376448      72.590734      72.467181  69.478121
male     68.821577      65.545643      63.446058  65.937759

#### Female gender has higher average score than male gender in writing and reading
#### Male gender has higher average score in maths

### Based on Test preparation course

In [191]:
data2=data.groupby(['test preparation course'])[['math score','reading score','writing score','avg score']].mean()
data2

                         math score  reading score  writing score  avg score
test preparation course
completed                  69.96648      74.175978      74.684358  72.942272
none                       63.78972      66.417445      64.457944  64.888370

#### *Students who completed the test preparation course have higher marks than the students who didn't

### 4. What do you think about the scoring variation for math, reading and writing based on
#### ● Gender
#### ● Test preparation course

#### Based on gender female students have an overall  higher average score than male students
#### Male students have high average score for maths but, they score less in both reading and writing

#### Based on test preperation course, the one who completed, score more than the one who didn't
#### On an overall maths score is less compared to average scores of reading and writing

### 5. The management needs your help to give bonus points to the top 25% of students based on their math score, so how will you help the management to achieve this.

In [192]:
np.percentile(data['math score'],75)

77.0

#### The students scored more than or equal to 75th percentile will be the top 25%. So there are 255 students in top 25%.

In [193]:
data3=data['math score'].ge(77)
data3.value_counts()

False    745
True     255
Name: math score, dtype: int64

In [194]:
data3

0      False
1      False
2      False
3      False
4      False
       ...
995     True
996     True
997     True
998     True
999     True
Name: math score, Length: 1000, dtype: bool